#面向对象的三大特性，继承，封装，多态
#封装
    #对成员变量的访问进行权限控制
    #三个级别
    #   公开的，    public
    #   受保护的，  protected
    #   隐私的，    private
#对于权限的判定
    #位置：类的内部，类的外部，子类

#----------------------------------------------------------------
#隐私属性       前面加两个_
class A():
    name = 'diff'
    def __init__(self):
        self.__age = 20
        self.qq = 123456
    def get_info(self):
        print(self.name,self.qq,self.__age)

a = A()
print(a.name,a.qq)
#print(a.__age)     私有的不能直接访问
a.get_info()        #私有的可以被内部访问

#对于私有变量的修改和访问可以增加getset方法

#如果非要访问私有变量，其实python解释器将变量名改成了_类名__私有变量名
print(a._A__age)
#----------------------------------------------------------------























































